cats/app/controllers/application_controller.rb

    def login!(user)
        @current_user = user
        session[:session_token] = user.session_token
        if user.session_tokens.find_by(session_token: user.session_token).nil?
            user.session_tokens.create!(session_token: user.session_token)
---
SELECT  "session_tokens".* FROM "session_tokens" WHERE "session_tokens"."user_id" = $1 AND "session_tokens"."session_token" = $2 LIMIT $3  [["user_id", 1], ["session_token", "JvK-SQYm6Wro13VmWsc2nQ"], ["LIMIT", 1]]
INSERT INTO "session_tokens" ("session_token", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["session_token", "JvK-SQYm6Wro13VmWsc2nQ"], ["user_id", 1], ["created_at", "2019-11-04 22:56:01.850143"], ["updated_at", "2019-11-04 22:56:01.850143"]]

    def current_user
        return nil if session[:session_token].nil?
        @current_user ||= SessionToken.find_by(session_token: session[:session_token]).user
---
SELECT  "session_tokens".* FROM "session_tokens" WHERE "session_tokens"."session_token" = $1 LIMIT $2  [["session_token", "JvK-SQYm6Wro13VmWsc2nQ"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "X5vATH61p_NRU3h4a6B6rg"], ["LIMIT", 1]]

    def cat_owner?(user)
        target_cat = user.cats.find_by(id: params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."user_id" = $1 AND "cats"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]