cats/app/controllers/users_controller.rb

    def create
      @user = User.new(users_params)

      if @user.save!
---
INSERT INTO "users" ("user_name", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"