cats/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."user_name" = $1 LIMIT $2  [["user_name", "peter1"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username, password)
        user = User.find_by(user_name: username)